[main] Merge branch 'fix/dosc_dir'
